/* Sidebar (MainWindow) */
"Overview" = "概要";
"Applications" = "アプリケーション";
"Cleanup" = "クリーンアップ";
"Dashboard" = "ダッシュボード";
"Installed Apps" = "インストール済みアプリ";
"Orphaned Files" = "孤立ファイル";
"MClean" = "MClean";
"Ready to clean" = "クリーンアップ可能";
"Limited access" = "アクセスが制限されています";
"Full Disk Access granted" = "フルディスクアクセスが許可されています";
"Grant FDA in Settings" = "設定でフルディスクアクセスを許可";
"Select a category from the sidebar to get started." = "サイドバーからカテゴリを選択して始めてください。";

/* FDA toast + clean error alert (MainWindow) */
"Couldn't clean everything" = "すべてを削除できませんでした";
"Open System Settings" = "システム設定を開く";
"OK" = "OK";
"Full Disk Access required" = "フルディスクアクセスが必要です";
"macOS blocks MClean from cleaning caches and uninstalling apps until you grant access." = "アクセスを許可するまで、macOSはMCleanによるキャッシュの削除やアプリのアンインストールをブロックします。";
"Grant Access" = "アクセスを許可";

/* Dashboard */
"Storage" = "ストレージ";
"Smart Scan" = "スマートスキャン";
"free of %@" = "%@中の空き容量";
"%lld%% used" = "%lld%% 使用中";
"Used" = "使用中";
"Junk" = "ジャンク";
"Purgeable" = "削除可能";
"USED" = "使用中";
"SCANNING" = "スキャン中";
"Free Space" = "空き容量";
"Junk Found" = "見つかったジャンク";
"Apps" = "アプリ";
"of %@ · %lld%% used" = "%@中 · %lld%% 使用中";
"Run a scan" = "スキャンを実行";
"across %lld categories" = "%lld カテゴリ";
"installed" = "インストール済み";
"APFS reclaimable" = "APFSで再利用可能";
"Suggested for you" = "あなたへのおすすめ";
"Found so far" = "これまでに見つかったもの";
"By category" = "カテゴリ別";
"%@ is using %@" = "%@ は %@ を使用しています";
"Grant Full Disk Access for full results" = "完全な結果を得るためにフルディスクアクセスを許可してください";
"Without it, most caches and uninstall flows fail." = "許可しないと、ほとんどのキャッシュ削除やアンインストールに失敗します。";
"Action" = "アクション";
"Scanning your Mac" = "Macをスキャン中";
"Currently in: %@" = "現在: %@";
"found" = "見つかりました";
"Your Mac is clean" = "Macはクリーンです";
"Scan Again" = "再スキャン";
"Clean %@" = "%@ をクリーンアップ";
"Clean %@?" = "%@ をクリーンアップしますか?";
"Cleaning…" = "クリーンアップ中…";
"%lld%% complete" = "%lld%% 完了";
"freed" = "解放";
"Done" = "完了";
"%lld items" = "%lld 個";

/* Common destructive dialog */
"Clean" = "クリーンアップ";
"Cancel" = "キャンセル";
"This will permanently delete the selected files. This cannot be undone." = "選択したファイルが完全に削除されます。この操作は取り消せません。";

/* Category Detail */
"All Clean" = "すべてクリーン";
"No junk files found in this category." = "このカテゴリにはジャンクファイルが見つかりませんでした。";
"Not Scanned" = "未スキャン";
"Run a scan to analyze this category." = "スキャンを実行してこのカテゴリを分析します。";
"Scan Now" = "今すぐスキャン";
"Filter files" = "ファイルを絞り込む";
"Scan" = "スキャン";
"Select All" = "すべて選択";
"Deselect All" = "選択解除";
"Largest First" = "大きい順";
"Smallest First" = "小さい順";
"Sorted: Largest First" = "並び順: 大きい順";
"Sorted: Smallest First" = "並び順: 小さい順";
"Clean %lld items" = "%lld 項目をクリーンアップ";
"%lld items · %@" = "%lld 項目 · %@";
"Scanning…" = "スキャン中…";
"Rescan" = "再スキャン";
"%lld of %lld selected" = "%lld / %lld 個を選択中";
"Reveal in Finder" = "Finderで表示";
"Copy Path" = "パスをコピー";
"Move to Trash" = "ゴミ箱に移動";

/* Apps (AppListView) */
"Search apps" = "アプリを検索";
"Refresh" = "更新";
"Installed Apps (%lld)" = "インストール済みアプリ (%lld)";
"Loading installed apps..." = "インストール済みアプリを読み込み中...";
"No Apps Found" = "アプリが見つかりません";
"Could not find any installed applications." = "インストール済みアプリケーションが見つかりませんでした。";
"Retry" = "再試行";
"Application" = "アプリケーション";
"Size" = "サイズ";
"Select an App" = "アプリを選択";
"Select an app from the list to see all its related files across your system." = "リストからアプリを選択すると、システム全体の関連ファイルが表示されます。";

/* App Files (AppFilesView) */
"%lld files" = "%lld ファイル";
"Scanning for related files..." = "関連ファイルをスキャン中...";
"Checking %lld locations..." = "%lld 個の場所を確認中...";
"No Related Files" = "関連ファイルがありません";
"No additional files found for %@." = "%@ の追加ファイルは見つかりませんでした。";
"Remove %lld files (%@)" = "%lld ファイルを削除 (%@)";
"Removal Failed" = "削除に失敗しました";
"Remove this file" = "このファイルを削除";
"Remove %@?" = "%@ を削除しますか?";
"Remove" = "削除";
"This will permanently delete this file. This action cannot be undone." = "このファイルが完全に削除されます。この操作は取り消せません。";

/* Orphans */
"Scanning for orphaned files..." = "孤立ファイルをスキャン中...";
"No Orphaned Files" = "孤立ファイルはありません";
"No leftover files from uninstalled apps were found." = "アンインストール済みアプリの残存ファイルは見つかりませんでした。";
"Scan for Orphans" = "孤立ファイルをスキャン";
"Orphaned Files (%lld)" = "孤立ファイル (%lld)";
"Remove Selected (%lld)" = "選択した項目を削除 (%lld)";
"Some files could not be removed" = "一部のファイルを削除できませんでした";

/* Onboarding */
"Back" = "戻る";
"Next" = "次へ";
"Get Started" = "始める";
"Welcome to MClean" = "MCleanへようこそ";
"Free, open-source macOS app manager and system cleaner." = "無料・オープンソースのmacOSアプリ管理&システムクリーナー。";
"Find junk files across your system" = "システム全体のジャンクファイルを検出";
"App Uninstaller" = "アプリアンインストーラ";
"Remove apps and all their files" = "アプリと関連ファイルをすべて削除";
"Orphan Finder" = "孤立ファイル検出";
"Find leftovers from deleted apps" = "削除済みアプリの残存物を検出";
"Full Disk Access" = "フルディスクアクセス";
"MClean needs Full Disk Access to uninstall apps, find leftover files, and clean protected caches." = "アプリのアンインストール、残存ファイルの検出、保護されたキャッシュのクリーンアップにはフルディスクアクセスが必要です。";
"We'll guide you through the next steps." = "次のステップへご案内します。";
"In System Settings, do this:" = "システム設定で次の操作を行ってください:";
"Privacy & Security → Full Disk Access" = "プライバシーとセキュリティ → フルディスクアクセス";
"Find **MClean** and turn the toggle on" = "**MClean** を見つけてスイッチをオンにする";
"Authenticate with Touch ID or your password" = "Touch IDまたはパスワードで認証";
"Reopen Settings" = "設定を再度開く";
"MClean isn't in the list — reveal it" = "MCleanがリストにない — 表示する";
"Reset permissions and re-prompt" = "アクセス権をリセットして再度求める";
"Hide diagnostics" = "診断情報を隠す";
"Show diagnostics" = "診断情報を表示";
"Trouble?" = "問題が発生しましたか?";
"Waiting for permission…" = "許可を待っています…";
"Permission granted." = "アクセスが許可されました。";
"MClean can now manage protected files." = "MCleanは保護されたファイルを管理できるようになりました。";
"You're Ready" = "準備完了";
"%lld/%lld protected locations accessible" = "%lld/%lld の保護された場所にアクセス可能";
"Some features will be limited. You can grant Full Disk Access later in System Settings." = "一部の機能は制限されます。フルディスクアクセスは後でシステム設定から許可できます。";
"Trash" = "ゴミ箱";
"Mail Data" = "メールデータ";
"Safari Data" = "Safariデータ";
"Desktop" = "デスクトップ";
"Documents" = "書類";
"TCC Database" = "TCCデータベース";
"Blocked" = "ブロック";

/* Settings */
"General" = "一般";
"Cleaning" = "クリーニング";
"Schedule" = "スケジュール";
"About" = "MCleanについて";
"Startup" = "起動";
"Launch MClean at login" = "ログイン時にMCleanを起動";
"App Scanning" = "アプリスキャン";
"Search sensitivity" = "検索の精度";
"Strict" = "厳格";
"Enhanced" = "拡張";
"Deep" = "詳細";
"Exact bundle ID and name matches only. Safest option." = "バンドルIDと名前が完全一致するもののみ。最も安全。";
"Includes partial name matching and bundle ID components." = "部分的な名前一致やバンドルID要素も含めます。";
"Includes company name, entitlements, and team identifier matching." = "会社名、エンタイトルメント、チームIDの一致を含めます。";
"Language" = "言語";
"Restart MClean to apply the selected language." = "選択した言語を適用するにはMCleanを再起動してください。";
"Relaunch Now" = "今すぐ再起動";
"System Default" = "システムデフォルト";
"English" = "英語";
"Spanish" = "スペイン語";
"Japanese" = "日本語";
"Arabic" = "アラビア語";
"Portuguese (Brazil)" = "ポルトガル語(ブラジル)";
"Chinese (Simplified)" = "中国語(簡体字)";
"Chinese (Traditional)" = "中国語(繁体字)";
"Safety" = "安全";
"Confirm before deleting files" = "ファイル削除前に確認";
"File Discovery" = "ファイル検出";
"Skip hidden files during scan" = "スキャン時に隠しファイルをスキップ";
"Large Files" = "大きなファイル";
"Minimum size: %lld MB" = "最小サイズ: %lld MB";
"Files older than: %lld months" = "%lld か月以上前のファイル";
"Automatic Scanning" = "自動スキャン";
"Enable scheduled scanning" = "スケジュールスキャンを有効化";
"Scan interval" = "スキャン間隔";
"Auto-clean after scan" = "スキャン後に自動クリーンアップ";
"Auto-purge purgeable space" = "削除可能領域を自動パージ";
"Notify on completion" = "完了時に通知";
"Last run" = "前回実行";
"Version %@" = "バージョン %@";
"Free, open-source macOS app manager." = "無料・オープンソースのmacOSアプリ管理ツール。";
"GitHub Repository" = "GitHubリポジトリ";
"Report an Issue" = "問題を報告";
"MIT License" = "MITライセンス";

/* Cleaning categories (CleaningCategory.rawValue) */
"System Junk" = "システムジャンク";
"User Cache" = "ユーザーキャッシュ";
"AI Apps" = "AIアプリ";
"Mail Files" = "メールファイル";
"Trash Bins" = "ゴミ箱";
"Large & Old Files" = "大きい・古いファイル";
"Purgeable Space" = "削除可能領域";
"Xcode Junk" = "Xcodeジャンク";
"Brew Cache" = "Brewキャッシュ";
"Node Cache" = "Nodeキャッシュ";
"Docker Cache" = "Dockerキャッシュ";

/* Cleaning category descriptions */
"Scan everything at once" = "すべてを一度にスキャン";
"System caches, logs, and temporary files" = "システムキャッシュ、ログ、一時ファイル";
"Application caches and browser data" = "アプリケーションキャッシュとブラウザデータ";
"Local AI app logs, caches, and optional history" = "ローカルAIアプリのログ、キャッシュ、任意の履歴";
"Downloaded mail attachments" = "ダウンロードしたメール添付ファイル";
"Files in your Trash" = "ゴミ箱内のファイル";
"Files over 100 MB or older than 1 year" = "100MB以上または1年以上前のファイル";
"APFS purgeable disk space" = "APFSの削除可能ディスク領域";
"Derived data, archives, and simulators" = "派生データ、アーカイブ、シミュレータ";
"Homebrew download cache" = "Homebrewのダウンロードキャッシュ";
"npm, yarn, and pnpm download caches" = "npm、yarn、pnpm のダウンロードキャッシュ";
"Docker images, containers, and build cache" = "Dockerイメージ、コンテナ、ビルドキャッシュ";

/* Node Cache subcategories */
"npm cache" = "npmキャッシュ";
"yarn classic cache" = "yarnクラシックキャッシュ";
"pnpm content-addressable store" = "pnpmコンテンツアドレッサブルストア";

/* Docker Cache helper */
"Reclaimable (run `docker system prune -af`)" = "再利用可能 ( `docker system prune -af` を実行)";

/* Schedule intervals (ScheduleInterval.rawValue) */
"Every Hour" = "1時間ごと";
"Every 3 Hours" = "3時間ごと";
"Every 6 Hours" = "6時間ごと";
"Every 12 Hours" = "12時間ごと";
"Daily" = "毎日";
"Weekly" = "毎週";
"Every 2 Weeks" = "2週間ごと";
"Monthly" = "毎月";

/* Schedule status */
"Never" = "なし";
"Not scheduled" = "未スケジュール";

/* Appearance modes (AppearanceMode.label) */
"System" = "システム";
"Light" = "ライト";
"Dark" = "ダーク";

/* Notifications */
"Found %@ of junk files." = "%@ のジャンクファイルが見つかりました。";

/* Permission Sheet */
"Grant Full Disk Access" = "フルディスクアクセスを付与";
"%lld item(s) need Full Disk Access" = "%lld 件にフルディスクアクセスが必要です";
"Uninstalling %@: %lld file(s) need Full Disk Access" = "%@ のアンインストール: %lld 個のファイルにフルディスクアクセスが必要です";
"%lld item(s) need Full Disk Access to remove. Tap Grant Access to fix in one step." = "%lld 件の削除にはフルディスクアクセスが必要です。「アクセスを許可」をタップすると一手で解決します。";
"Couldn't remove %@%@. They may be in use or protected by macOS." = "%@%@ を削除できませんでした。使用中か macOS によって保護されている可能性があります。";
" and %lld more" = " 他 %lld 件";
"Access granted. Retrying…" = "アクセスが許可されました。再試行中…";
"1-tap setup. We'll detect the change automatically." = "ワンタップ設定。変更は自動的に検出されます。";
"Open Settings & reveal MClean" = "設定を開き MClean を表示";
"We'll open both windows side-by-side." = "両方のウインドウを並べて開きます。";
"Turn on MClean" = "MClean をオンにする";
"Toggle the row that appears." = "表示された行をオンに切り替えてください。";
"Authenticate" = "認証";
"Touch ID or password." = "Touch ID またはパスワード。";
"We auto-retry — no need to come back." = "自動的に再試行します - 戻る必要はありません。";
"Watching for permission change…" = "権限の変更を待機中…";
"MClean not in the list?" = "MClean がリストに表示されない？";
"Hide help" = "ヘルプを隠す";
"Try this if MClean doesn't appear:" = "MClean が表示されない場合はこれを試してください:";
"Reveal app" = "アプリを表示";
"Drag MClean.app into the list" = "MClean.app をリストにドラッグ";
"Reset + reprompt" = "リセットして再表示";
"Clear stale TCC entry" = "古い TCC エントリを削除";
"+ %lld more" = "+ %lld 件";
"%lld blocked path(s)" = "%lld 件のブロックされたパス";
"Access granted" = "アクセス許可済み";
"Retrying the operation now." = "操作を再試行しています。";
"Skip for now" = "今はスキップ";
"I granted it — retry" = "許可したので再試行";

/* Dashboard polish */
"Low space" = "空き容量不足";
"CLEANING" = "クリーニング中";
"Quick Setup" = "クイックセットアップ";
"1-tap setup. We'll auto-retry what failed." = "ワンタップ設定。失敗した処理は自動的に再試行します。";
"Fix permission" = "権限を修正";
"Dismiss" = "閉じる";

/* Onboarding v2 */
"Reclaim your Mac" = "Mac を取り戻そう";
"Apple sells you small disks. We help you keep them clean." = "Apple のストレージは小さい。だからこそ、きれいに保ちます。";
"Free. Open source. MIT licensed." = "無料。オープンソース。MIT ライセンス。";
"What's inside" = "中身を見る";
"Three things, done well." = "3 つのことを、しっかりと。";
"Find caches, logs, broken installs, and the AI-app history hiding in your library." = "キャッシュ、ログ、壊れたインストール、ライブラリに潜む AI アプリの履歴を見つけます。";
"Drag an app, see every file it dropped, remove all of it. No leftovers." = "アプリをドラッグして、残したすべてのファイルを確認し、まとめて削除。残骸ゼロ。";
"Surfaces files that outlived the apps that created them." = "アプリを削除した後も残ったファイルを表示します。";
"One permission, then we're done" = "1 つの権限、それだけ";
"Permission granted" = "権限を付与しました";
"MClean can now reach the locations macOS protects by default." = "MClean は macOS が標準で保護している場所にアクセスできるようになりました。";
"macOS hides certain folders from every app until you say otherwise. We need them to find caches and uninstall cleanly." = "macOS は許可するまですべてのアプリから一部のフォルダを隠します。キャッシュの発見とクリーンなアンインストールに必要です。";
"All set — moving you to the next step." = "準備完了 - 次のステップへ進みます。";
"Reveal app again" = "アプリをもう一度表示";
"Reset permissions" = "権限をリセット";
"You're ready" = "準備完了";
"Ready when you are" = "いつでもどうぞ";
"Hit Start to run your first Smart Scan." = "「開始」を押して最初のスマートスキャンを実行。";
"Skip" = "スキップ";
"Start" = "開始";
"Continue" = "続ける";

/* Drag handle */
"Drag to the Settings list" = "設定のリストにドラッグ";
"Drag this icon into the Full Disk Access list in System Settings." = "このアイコンをシステム設定のフルディスクアクセスのリストにドラッグしてください。";
"Tip: drag the icon on the left straight into the list." = "ヒント: 左のアイコンをそのままリストにドラッグできます。";
"Or drag the icon on the left straight into Settings." = "または左のアイコンをそのまま設定にドラッグしてください。";

/* Dashboard storage composition (v2.7.0) */
"Storage composition" = "ストレージの内訳";
"total" = "合計";
"Free" = "空き";

/* UI polish (v2.8.0): leftover groups + sound toggle */
"Application" = "アプリケーション";
"Caches" = "キャッシュ";
"Application Support" = "アプリケーションサポート";
"Preferences" = "環境設定";
"Logs" = "ログ";
"Containers" = "コンテナ";
"Launch Agents" = "起動エージェント";
"Other Files" = "その他のファイル";
"Sound" = "サウンド";
"Play sound effects" = "効果音を再生";

/* v2.8.1: purgeable honesty */
"Managed by macOS" = "macOS が管理";
"Reserved by macOS - freed automatically when space is needed" = "macOS が予約 - 空き容量が必要になると自動的に解放されます";

/* v2.8.2: large-file folder exclusions (#121) */
"Excluded Folders" = "除外するフォルダ";
"Files inside these folders are skipped from the Large & Old Files scan (Downloads, Documents, Desktop)." = "これらのフォルダ内のファイルは「大きい/古いファイル」スキャン（ダウンロード、書類、デスクトップ）でスキップされます。";
"Remove from exclusions" = "除外から削除";
"Add Folder…" = "フォルダを追加…";

/* v2.8.2: orphan ignore list (#114) */
"Always Ignore" = "常に無視";
"Ignore Selected (%lld)" = "選択した項目を無視 (%lld)";
"Ignored orphans: %lld" = "無視した孤立ファイル: %lld";
"Forget Ignored" = "無視リストを消去";
"Ignored files won't appear in future orphan scans." = "無視したファイルは今後の孤立ファイルのスキャンに表示されません。";

/* v2.8.3: menu-bar system monitor */
"System Monitor" = "システムモニタ";
"Show system monitor in menu bar" = "メニューバーにシステムモニタを表示";
"Live CPU, memory, and disk meters in the menu bar. MClean keeps running in the background while this is on." = "CPU、メモリ、ディスクの使用状況をメニューバーにリアルタイム表示します。オンの間、MCleanはバックグラウンドで動作し続けます。";
"CPU" = "CPU";
"Memory" = "メモリ";
"Disk" = "ディスク";
"Open MClean" = "MCleanを開く";
"Quit MClean" = "MCleanを終了";

/* Space Lens */
"Space Lens" = "Space Lens";
"See what's taking up space. Scan a folder to map its contents as bubbles you can explore and clean." = "何が容量を占めているかを確認。フォルダをスキャンして、中身をバブルとして表示し、探索して掃除できます。";
"Scan Home Folder" = "ホームフォルダをスキャン";
"Choose Folder…" = "フォルダを選択…";
"%d items" = "%d 項目";
"Stop Scan" = "スキャンを停止";
"%d smaller items" = "%d 件の小さな項目";
"Nothing selected" = "未選択";
"Selected: %@" = "選択中: %@";
"Move %d items (%@) to the Trash?" = "%d 個の項目(%@)をゴミ箱に入れますか?";
"Items can be restored from the Trash." = "項目はゴミ箱から復元できます。";
"Access denied" = "アクセスが拒否されました";
"Other" = "その他";
"Couldn't move some items to the Trash" = "一部の項目をゴミ箱に移動できませんでした";

/* FDA relaunch detection */
"Access granted — relaunch to apply" = "アクセスが許可されました — 再起動で適用されます";
"macOS applies Full Disk Access when MClean starts again. Relaunch to finish — takes a second." = "macOS はフルディスクアクセスを MClean の再起動後に適用します。再起動して完了してください — 一瞬で終わります。";
"Relaunch MClean" = "MClean を再起動";

/* Donate (About) */
"Buy me a coffee ☕" = "コーヒーをおごる ☕";
"If MClean is useful to you, a small donation keeps it going. Thank you!" = "MClean が役に立ったら、小さな寄付が開発の支えになります。ありがとうございます!";
"Scan with MoMo or your banking app (VietQR · Napas 247)" = "MoMo または銀行アプリでスキャン (VietQR · Napas 247)";
